[
  {
    "exerciseId" : 1,
    "exercisePoints": 10,
    "exerciseName": "Pompki",
    "description": "Pełna pompka z podciąganiem napina mięśnie pośladków i brzucha. Jeśli masz problem z utrzymaniem dobrej pozycji lub zrobieniem całego zestawu, pompkę zrobisz na kolanach lub na platformie",
    "url": "brak",
    "exerciseCategory": "CORE_EXERCISES"
  },
  {
    "exerciseId" : 2,
    "exercisePoints": 10,
    "exerciseName": "Unoszenie hantli z przodu",
    "description": "Lekkie hantle, napnij pośladki i podnieś hantle przed siebie",
    "url": "brak",
    "exerciseCategory": "CORE_EXERCISES"
  },
  {
    "exerciseId" : 3,
    "exercisePoints": 10,
    "exerciseName": "Wznosy boczne z hantlami",
    "description": "Lekkie hantle, napnij pośladki i unieś hantle na bok",
    "url": "brak",
    "exerciseCategory": "CORE_EXERCISES"
  },
  {
    "exerciseId" : 4,
    "exercisePoints": 10,
    "exerciseName": "Zwis",
    "description": "Wiszące na prostym pasku. Wisisz obiema rękami przez 20 sekund z 20-sekundową przerwą. Aktywny zwis, ramiona napięte, nogi przed sobą. Jeśli nie możesz wisieć przez 20 sekund bez przerwy, podłóż pudełko pod nogi krzesła lub podeprzyj się, ale nie możesz puścić drążka przez 20 sekund.",
    "url": "youtube.com",
    "exerciseCategory": "CORE_EXERCISES"
  },
  {
    "exerciseId" : 5,
    "exercisePoints": 10,
    "exerciseName": "Brzuszki",
    "description": "Dziesięć różnych ćwiczeń na mięśnie brzucha, 1 podciąganie, 2 russian twist, 3 dotykanie rąk i nóg, 4 unoszenie nóg; 5tablica; 6 skośne naprzemiennie; 7 wydrążonych korpusów; 8 tablic bocznych; 9 planszy bocznej; 10 rowerów. Ćwiczysz 20 sekund, odpoczywasz 40 sekund. Robisz to za pomocą swojego mobilnego zegarka. Pobierz aplikację tabata i ustal godzinę, w której będziesz pracować.",
    "url": "brak",
    "exerciseCategory": "CORE_EXERCISES"
  },
  {
    "exerciseId" : 6,
    "exercisePoints": 10,
    "exerciseName": "Opuszczanie z prostej belki",
    "description": "Ustawienie w pozycji górnej na drążku np. z krzesła. Następnie zawiśnij i jak najwolniej opuść się do wyciągniętych ramion.",
    "url": "brak",
    "exerciseCategory": "CORE_EXERCISES"
  },
  {
    "exerciseId" : 7,
    "exercisePoints": 10,
    "exerciseName": "Podciąganie kątowe na linie",
    "description": "Podciąganie na linie w pozycji nogi do przodu, trzymając równomiernie oba końce.",
    "url": "brak",
    "exerciseCategory": "CORE_EXERCISES"
  },
  {
    "exerciseId" : 8,
    "exercisePoints": 10,
    "exerciseName": "Bieg 3km",
    "description": "Spokojny, ciągły bieg w równym tempie. Zaczynasz spokojnie i biegniesz równym tempem przez około 18-20 minut.",
    "url": "brak",
    "exerciseCategory": "WARM_UP"
  },
  {
    "exerciseId" : 9,
    "exercisePoints": 10,
    "exerciseName": "Chodzenie z rękami na drążkach",
    "description": "Po biegu przejście na prostych ramionach (wymach) kije (co 2 kije) zaczynasz raz z prawej raz z lewej ręki.",
    "url": "brak",
    "exerciseCategory": "CORE_EXERCISES"
  },
  {
    "exerciseId" : 10,
    "exercisePoints": 10,
    "exerciseName": "Pajacyki boczne",
    "description": "Pajacyki boczne wykonywane przez 1 min",
    "url": "brak",
    "exerciseCategory": "WARM_UP"
  },
  {
    "exerciseId" : 11,
    "exercisePoints": 10,
    "exerciseName": "Pajacyki z przodu",
    "description": "Przednie pajacyki wykonywane przez 1 min",
    "url": "youtube.com",
    "exerciseCategory": "WARM_UP"
  },
  {
    "exerciseId" : 12,
    "exercisePoints": 10,
    "exerciseName": "Bieg bokserski",
    "description": "Bieg bokserski przez 1 min",
    "url": "youtube.com",
    "exerciseCategory": "CORE_EXERCISES"
  },
  {
    "exerciseId" : 13,
    "exercisePoints": 10,
    "exerciseName": "Kręcenie rękoma w kółko",
    "description": "Obracaj koła rękami do przodu, potem do tyłu, a na końcu na przemian. Razem 2 minuty.",
    "url": "youtube.com",
    "exerciseCategory": "WARM_UP"
  },
  {
    "exerciseId" : 14,
    "exercisePoints": 10,
    "exerciseName": "Obracanie kół z biodrami",
    "description": "Obracaj biodrami w kółko z nogami i głową nieruchomo.",
    "url": "youtube.com",
    "exerciseCategory": "WARM_UP"
  },
  {
    "exerciseId" : 15,
    "exercisePoints": 10,
    "exerciseName": "Wygięcia z huśtawką",
    "description": "Przysiady z naprzemiennym dotykaniem stóp i wymachiwaniem ręki w górę, staramy się pilnować, aby ręka unosiła się do góry. Razem 1-2 minuty.",
    "url": "youtube.com",
    "exerciseCategory": "WARM_UP"
  },
  {
    "exerciseId" : 16,
    "exercisePoints": 10,
    "exerciseName": "Skręty ramion",
    "description": "Naprzemiennie skręcając ręce w ramionach, prosty tułów, dłonie w górę iw dół o 180 stopni. Aktywacja mięśni głębokich.",
    "url": "youtube.com",
    "exerciseCategory": "WARM_UP"
  },
  {
    "exerciseId" : 17,
    "exercisePoints": 10,
    "exerciseName": "Krokodylki",
    "description": "Stopy rozstawione na szerokość barków, otwarte pod kątem 10-30 stopni, płaskie. 2) Ciężar ciała przeniesiony na pięty (nie odrywają się od ziemi nawet na chwilę). 3) Plecy proste, tułów napięty, głowa w naturalnej pozycji, oczy skierowane do przodu.  Stopy rozstawione na szerokość barków, otwarte pod kątem 10-30 stopni, płaskie. 2) Ciężar ciała przeniesiony na pięty (nie odrywają się od podłoża ani na chwilę). 3) Plecy proste, tułów napięty, głowa w naturalnej pozycji, oczy skierowane do przodu.",
    "url": "youtube.com",
    "exerciseCategory": "CORE_EXERCISES"
  },
  {
    "exerciseId" : 18,
    "exercisePoints": 10,
    "exerciseName": "Rozciąganie pleców",
    "description": "Po treningu uklęknij i opuść ciało. Oprzyj pośladki na nogach, a klatkę piersiową na udach. W tej pozie, zwanej \"japońskim ukłonem\", plecy są wygięte w łuk, co pomaga złagodzić nocne napięcie. Możesz rozciągnąć plecy, opierając dłonie na krawędzi stołu lub fotela podczas pochylania się. Pamiętaj, aby nie garbić się ani nie garbić ramion.",
    "url": "youtube.com",
    "exerciseCategory": "STRETCHING"
  },
  {
    "exerciseId" : 19,
    "exercisePoints": 10,
    "exerciseName": "Rozciąganie całego ciała",
    "description": "Połóż się na brzuchu z wyciągniętymi rękami i nogami. Podnieś lekko głowę i klatkę piersiową i ostrożnie podnieś jedno ramię wraz z przeciwną nogą. Powtórz po obu stronach ciała, aby wydłużyć i wyprostować kręgosłup i kończyny.",
    "url": "youtube.com",
    "exerciseCategory": "STRETCHING"
  },
  {
    "exerciseId" : 20,
    "exercisePoints": 10,
    "exerciseName": "Rozciąganie pleców i brzucha",
    "description": "Połóż się na plecach, zegnij kolana, połóż stopy płasko i połóż ręce wzdłuż ciała. Powoli unieś pośladki i biodra do góry, opierając ciężar ciała na stopach i ramionach. W tej pozycji pracują wszystkie mięśnie, nawet te głębokie. Jeśli masz miękki materac, to ćwiczenie może być trudne. W takim przypadku możesz przenieść się na podłogę za pomocą maty do ćwiczeń.",
    "url": "youtube.com",
    "exerciseCategory": "STRETCHING"
  },
  {
    "exerciseId" : 21,
    "exercisePoints": 5,
    "exerciseName": "Rozciąganie szyi",
    "description": "Przechyl głowę lekko na bok lub lekko do przodu i delikatnie naciśnij głowę dłonią. Powtórz po drugiej stronie. To ćwiczenie należy wykonywać ze szczególną ostrożnością, ponieważ mięśnie karku są dość delikatne.",
    "url": "youtube.com",
    "exerciseCategory": "STRETCHING"
  },
  {
    "exerciseId" : 22,
    "exercisePoints": 10,
    "exerciseName": "Rozciąganie ramion",
    "description": "Wyciągnij ramię na bok, a następnie zegnij w łokciu dłońmi do góry (jak uczeń z wahaniem poddający się odpowiedzi). Teraz oprzyj przedramię o framugę drzwi lub półkę z książkami i delikatnie wykręcając biodra, powoli rozciągnij ramię. Wykonaj to samo ćwiczenie drugą ręką.",
    "url": "youtube.com",
    "exerciseCategory": "STRETCHING"
  },
  {
    "exerciseId" : 23,
    "exercisePoints": 5,
    "exerciseName": "Rozciąganie przedramienia",
    "description": "Wyciągnij rękę przed siebie i opuść ją luźno. Drugą ręką naciśnij dłoń.",
    "url": "youtube.com",
    "exerciseCategory": "STRETCHING"
  },
  {
    "exerciseId" : 24,
    "exercisePoints": 5,
    "exerciseName": "Rozciąganie nóg",
    "description": "Na początek spróbuj stanąć z szerszymi stopami i zegnij prawą nogę, do przodu i do lewej. Usiądź ze złączonymi stopami i spróbuj zbliżyć pięty tak blisko, jak to możliwe, nie unosząc kolan. Możesz także położyć prostą nogę na krześle i pochylić się w jej kierunku.",
    "url": "youtube.com",
    "exerciseCategory": "STRETCHING"
  },
  {
    "exerciseId" : 25,
    "exercisePoints": 10,
    "exerciseName": "Deska",
    "description": "Deska to ćwiczenie z masą własnego ciała, które polega na trzymaniu tułowia w linii prostej nad ziemią. Ćwiczenie statyczne angażuje jednocześnie wiele grup mięśniowych, co czyni je niezwykle skutecznym we wzmacnianiu rdzenia, jednocześnie angażując barki, ramiona i pośladki.",
    "url": "youtube.com",
    "exerciseCategory": "CORE_EXERCISES"
  }
]